# 課題0703

そのまま課題ファイルで編集しないでください。課題ファイルを複製してから課題を回答してください。

## 課題1

pandasでDataフォルダの```example.json```を読み込む。

In [55]:
import pandas as pd
import numpy as np
df = pd.read_json('./Data/example.json', lines=True)

In [59]:
df

     Name  Price  Model  Power
0   Honda  10000   2005   1300
1  Toyota  12000   2010   1600
2    Audi  25000   2017   1800
3    Ford  28000   2009   1200

## 課題2

pandasでDataフォルダの```state-abbrevs.csv```、```state-areas.csv```、```state-population.csv```を読み込む。

これらのデータを使って、**2010年**アメリカの各州の人口密度を計算しよう。

In [75]:
df_abbrevs = pd.read_csv("./Data/state-abbrevs.csv")
df_areas = pd.read_csv("./Data/state-areas.csv")
df_population = pd.read_csv("./Data/state-population.csv")

In [56]:
df_abbrevs

                   state abbreviation
0                Alabama           AL
1                 Alaska           AK
2                Arizona           AZ
3               Arkansas           AR
4             California           CA
5               Colorado           CO
6            Connecticut           CT
7               Delaware           DE
8   District of Columbia           DC
9                Florida           FL
10               Georgia           GA
11                Hawaii           HI
12                 Idaho           ID
13              Illinois           IL
14               Indiana           IN
15                  Iowa           IA
16                Kansas           KS
17              Kentucky           KY
18             Louisiana           LA
19                 Maine           ME
20               Montana           MT
21              Nebraska           NE
22                Nevada           NV
23         New Hampshire           NH
24            New Jersey           NJ
25            New Mexico           NM
26              New York           NY
27        North Carolina           NC
28          North Dakota           ND
29                  Ohio           OH
30              Oklahoma           OK
31                Oregon           OR
32              Maryland           MD
33         Massachusetts           MA
34              Michigan           MI
35             Minnesota           MN
36           Mississippi           MS
37              Missouri           MO
38          Pennsylvania           PA
39          Rhode Island           RI
40        South Carolina           SC
41          South Dakota           SD
42             Tennessee           TN
43                 Texas           TX
44                  Utah           UT
45               Vermont           VT
46              Virginia           VA
47            Washington           WA
48         West Virginia           WV
49             Wisconsin           WI
50               Wyoming           WY

In [57]:
df_areas

                   state  area (sq. mi)
0                Alabama          52423
1                 Alaska         656425
2                Arizona         114006
3               Arkansas          53182
4             California         163707
5               Colorado         104100
6            Connecticut           5544
7               Delaware           1954
8                Florida          65758
9                Georgia          59441
10                Hawaii          10932
11                 Idaho          83574
12              Illinois          57918
13               Indiana          36420
14                  Iowa          56276
15                Kansas          82282
16              Kentucky          40411
17             Louisiana          51843
18                 Maine          35387
19              Maryland          12407
20         Massachusetts          10555
21              Michigan          96810
22             Minnesota          86943
23           Mississippi          48434
24              Missouri          69709
25               Montana         147046
26              Nebraska          77358
27                Nevada         110567
28         New Hampshire           9351
29            New Jersey           8722
30            New Mexico         121593
31              New York          54475
32        North Carolina          53821
33          North Dakota          70704
34                  Ohio          44828
35              Oklahoma          69903
36                Oregon          98386
37          Pennsylvania          46058
38          Rhode Island           1545
39        South Carolina          32007
40          South Dakota          77121
41             Tennessee          42146
42                 Texas         268601
43                  Utah          84904
44               Vermont           9615
45              Virginia          42769
46            Washington          71303
47         West Virginia          24231
48             Wisconsin          65503
49               Wyoming          97818
50  District of Columbia             68
51           Puerto Rico           3515

In [76]:
df_population

     state/region     ages  year   population
0              AL  under18  2012    1117489.0
1              AL    total  2012    4817528.0
2              AL  under18  2010    1130966.0
3              AL    total  2010    4785570.0
4              AL  under18  2011    1125763.0
...           ...      ...   ...          ...
2539          USA    total  2010  309326295.0
2540          USA  under18  2011   73902222.0
2541          USA    total  2011  311582564.0
2542          USA  under18  2012   73708179.0
2543          USA    total  2012  313873685.0

[2544 rows x 4 columns]

## 課題3

```state/region```、```ages```と```years```でデータフレームをグループして、各グループで$\frac{population}{area (sq. mi)}$の形で人口密度を計算してください。

In [77]:
#state, abbreviation, areaでデータフレームの結合
#Puerto Ricoはアメリカの週ではないので、欠落させる
constant = pd.merge(df_abbrevs, df_areas, on='state', how='inner')
display(constant)

                   state abbreviation  area (sq. mi)
0                Alabama           AL          52423
1                 Alaska           AK         656425
2                Arizona           AZ         114006
3               Arkansas           AR          53182
4             California           CA         163707
5               Colorado           CO         104100
6            Connecticut           CT           5544
7               Delaware           DE           1954
8   District of Columbia           DC             68
9                Florida           FL          65758
10               Georgia           GA          59441
11                Hawaii           HI          10932
12                 Idaho           ID          83574
13              Illinois           IL          57918
14               Indiana           IN          36420
15                  Iowa           IA          56276
16                Kansas           KS          82282
17              Kentucky           KY          40411
18             Louisiana           LA          51843
19                 Maine           ME          35387
20               Montana           MT         147046
21              Nebraska           NE          77358
22                Nevada           NV         110567
23         New Hampshire           NH           9351
24            New Jersey           NJ           8722
25            New Mexico           NM         121593
26              New York           NY          54475
27        North Carolina           NC          53821
28          North Dakota           ND          70704
29                  Ohio           OH          44828
30              Oklahoma           OK          69903
31                Oregon           OR          98386
32              Maryland           MD          12407
33         Massachusetts           MA          10555
34              Michigan           MI          96810
35             Minnesota           MN          86943
36           Mississippi           MS          48434
37              Missouri           MO          69709
38          Pennsylvania           PA          46058
39          Rhode Island           RI           1545
40        South Carolina           SC          32007
41          South Dakota           SD          77121
42             Tennessee           TN          42146
43                 Texas           TX         268601
44                  Utah           UT          84904
45               Vermont           VT           9615
46              Virginia           VA          42769
47            Washington           WA          71303
48         West Virginia           WV          24231
49             Wisconsin           WI          65503
50               Wyoming           WY          97818

In [80]:
#人口データのクレンジング
# state/region, year, agesの3つのカラムをソート
temp = df_population.sort_values(by=["state/region","year","ages"], ascending=True)
#カラム名state/regionをabbreviationに変更
temp = temp.rename(columns={"state/region":"abbreviation"})
temp = pd.merge(temp, constant, on='abbreviation', how='inner')
temp

     abbreviation     ages  year  population    state  area (sq. mi)
0              AK    total  1990    553290.0   Alaska         656425
1              AK  under18  1990    177502.0   Alaska         656425
2              AK    total  1991    570193.0   Alaska         656425
3              AK  under18  1991    182180.0   Alaska         656425
4              AK    total  1992    588736.0   Alaska         656425
...           ...      ...   ...         ...      ...            ...
2443           WY  under18  2011    135407.0  Wyoming          97818
2444           WY    total  2012    576626.0  Wyoming          97818
2445           WY  under18  2012    136526.0  Wyoming          97818
2446           WY    total  2013    582658.0  Wyoming          97818
2447           WY  under18  2013    137679.0  Wyoming          97818

[2448 rows x 6 columns]

In [85]:
#人口密度を求める
temp["population density"] = temp["population"]/temp["area (sq. mi)"]
result = temp[["state", "ages", "year", "population density"]] 
result

        state     ages  year  population density
0      Alaska    total  1990            0.842884
1      Alaska  under18  1990            0.270407
2      Alaska    total  1991            0.868634
3      Alaska  under18  1991            0.277534
4      Alaska    total  1992            0.896882
...       ...      ...   ...                 ...
2443  Wyoming  under18  2011            1.384275
2444  Wyoming    total  2012            5.894886
2445  Wyoming  under18  2012            1.395714
2446  Wyoming    total  2013            5.956552
2447  Wyoming  under18  2013            1.407502

[2448 rows x 4 columns]

# 以下、授業内課題

年齢が30-50歳の男性のデータを取り出し、Name, Age, Sexを示してください。

In [1]:
import pandas as pd
import numpy as np

In [2]:
df=pd.read_csv("https://raw.githubusercontent.com/lvzeyu/css_tohoku/master/css_tohoku/draft/Data/titanic.csv")

In [18]:
df.loc[(df["age"]>29)&(df["age"]<51),["name","age","sex"]]

                                                 name   age     sex
3                Allison, Mr. Hudson Joshua Creighton  30.0    male
5                                 Anderson, Mr. Harry  48.0    male
7                              Andrews, Mr. Thomas Jr  39.0    male
10                             Astor, Col. John Jacob  47.0    male
17    Baxter, Mrs. James (Helene DeLaudeniere Chaput)  50.0  female
...                                               ...   ...     ...
1285                              Wenzel, Mr. Linhart  32.5    male
1286  Whabee, Mrs. George Joseph (Shawneene Abi-Saab)  38.0  female
1290                 Wilkes, Mrs. James (Ellen Needs)  47.0  female
1298                        Wittevrongel, Mr. Camille  36.0    male
1301                             Youseff, Mr. Gerious  45.5    male

[382 rows x 3 columns]

## 実習問題1
ラムダ関数を適用することで男性ダミー変数を作成しよう。

## 実習問題2
Cabin変数によって、頭文字で新しいカテゴリ変数を作成しよう。例えば、C105の場合はCに変更します。

In [44]:
def first_character(text):
    text =str(text)
    if text and text != "nan":
        return text[0]
    else:
        return None

In [45]:
df["Cabin Letter"] = df["cabin"].apply(first_character)
df

,pclass,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest,survived,Cabin Letter
0,1.0,"Allen, Miss. Elisabeth Walton",female,29.0000,0.0,0.0,24160,211.3375,B5,S,2,NaN,"St Louis, MO",1,B
1,1.0,"Allison, Master. Hudson Trevor",male,0.9167,1.0,2.0,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON",1,C
2,1.0,"Allison, Miss. Helen Loraine",female,2.0000,1.0,2.0,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON",0,C
3,1.0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1.0,2.0,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON",0,C
4,1.0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1.0,2.0,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON",0,C
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1304,3.0,"Zabour, Miss. Hileni",female,14.5000,1.0,0.0,2665,14.4542,NaN,C,NaN,328.0,NaN,0,None
1305,3.0,"Zabour, Miss. Thamine",female,NaN,1.0,0.0,2665,14.4542,NaN,C,NaN,NaN,NaN,0,None
1306,3.0,"Zakarian, Mr. Mapriededer",male,26.5000,0.0,0.0,2656,7.2250,NaN,C,NaN,304.0,NaN,0,None
1307,3.0,"Zakarian, Mr. Ortin",male,27.0000,0.0,0.0,2670,7.2250,NaN,C,NaN,NaN,NaN,0,None
1308,3.0,"Zimmerman, Mr. Leo",male,29.0000,0.0,0.0,315082,7.8750,NaN,S,NaN,NaN,NaN,0,None